/**
 ******************************************************************************
 * @file           : drv_misc.h
 * @brief          : header file for drv_misc.c
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 GMaster
 * All rights reserved.
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __DRV_MISC_H
#define __DRV_MISC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "gsrl_common.h"

/* Exported types ------------------------------------------------------------*/

/******************************************************************************
 *                            DWT计时器
 ******************************************************************************/
typedef struct
{
    uint32_t s;
    uint16_t ms;
    uint16_t us;
} DWT_Time_t;

/* Exported constants --------------------------------------------------------*/

/* Exported variables --------------------------------------------------------*/
/******************************************************************************
 *                            DWT计时器
 ******************************************************************************/
extern DWT_Time_t SysTime;

/* Exported macro ------------------------------------------------------------*/

/* Exported functions prototypes ---------------------------------------------*/

/******************************************************************************
 *                            延迟类函数
 ******************************************************************************/
void Delay_us(uint16_t us);
void Delay_ms(uint16_t ms);

/******************************************************************************
 *                            DWT计时器
 ******************************************************************************/
void DWT_Init(void);
bool DWT_IsInit(void);
uint32_t DWT_GetTimestamp(void);
fp32 DWT_GetDeltaTime(uint32_t *cnt_last);
fp64 DWT_GetDeltaTime64(uint32_t *cnt_last);
fp32 DWT_GetTimeline_s(void);
fp32 DWT_GetTimeline_ms(void);
uint64_t DWT_GetTimeline_us(void);
void DWT_Delay(fp32 Delay);
void DWT_SysTimeUpdate(void);

/* Defines -------------------------------------------------------------------*/

#ifdef __cplusplus
}
#endif

#endif /* __DRV_MISC_H */
